nicolas-codemate/esp32-pixelcast/src/main.cpp
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t cyan = dma_display->color565(0, 180, 255);
    uint16_t paleBlue = dma_display->color565(100, 160, 255);
    uint16_t gray = dma_display->color565(140, 140, 140);
    uint16_t amber = dma_display->color565(255, 180, 50);
    uint16_t coldBlue = dma_display->color565(80, 140, 255);
    uint16_t warmRed = dma_display->color565(255, 50, 30);
    uint16_t black = dma_display->color565(0, 0, 0);

    // ============================================================
    // Layout map (64x64 display)
    // NULL font: setCursor = top-left of glyph, char is 7px tall
    // TomThumb: setCursor = baseline, uppercase chars 5px above baseline
    // ============================================================
    // y=0-8:    current weather (icon 8x8 + temp + min/max)
    // y=10:     separator
    // y=14-20:  HH:MM (NULL font top=14) + :SS (TomThumb baseline=21)
    // y=23-29:  date (NULL font top=23)
    // y=31:     separator
    // y=33-63:  forecast (31px)
    //   y=39:     day names (TomThumb baseline=39)
    //   y=41-48:  forecast icons (8x8)
    //   y=56:     min temps (TomThumb baseline=56)
    //   y=63:     max temps (TomThumb baseline=63)
    // ============================================================

    if (needsFullRedraw) {
        // Clear and redraw each section individually to avoid full-screen flicker
        // (DOUBLE_BUFFER is off on Trinity, so the DMA scans the buffer live)

        // ---- Current weather (y=0-10) ----
        dma_display->fillRect(0, 0, DISPLAY_WIDTH, 11, black);
        int16_t weatherTextX = 2;
        const uint16_t* builtinCurrentIcon = getBuiltinWeatherIcon(weatherData.currentIcon);
        if (builtinCurrentIcon) {
            drawProgmemIcon(dma_display, builtinCurrentIcon, 1, 1, 1);
            weatherTextX = 11;
        } else {
            CachedIcon* currentIcon = getIcon(weatherData.currentIcon);
            if (currentIcon && currentIcon->valid) {
                drawIconAtScale(currentIcon, 1, 1, 1);
                weatherTextX = 11;
            }
        }

        // Temperature (NULL font, top at y=2 to align with icon)
        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(white);

        char tempStr[8];
        snprintf(tempStr, sizeof(tempStr), "%d", weatherData.currentTemp);
        dma_display->setCursor(weatherTextX, 2);
        dma_display->print(tempStr);

        // Degree symbol (small circle, superscript position)
        int16_t degreeX = weatherTextX + strlen(tempStr) * 6;
        dma_display->drawPixel(degreeX + 1, 1, white);
        dma_display->drawPixel(degreeX,     2, white);
        dma_display->drawPixel(degreeX + 2, 2, white);
        dma_display->drawPixel(degreeX + 1, 3, white);

        // "C" after degree (NULL font, same top as temp)
        int16_t cX = degreeX + 4;
        dma_display->setCursor(cX, 2);
        dma_display->print("C");

        // Today's min/max on right side (NULL font, right-aligned)
        char todayMinStr[8], todayMaxStr[8];
        snprintf(todayMinStr, sizeof(todayMinStr), "%d", weatherData.currentTempMin);
        snprintf(todayMaxStr, sizeof(todayMaxStr), "%d", weatherData.currentTempMax);
        int16_t todayMinW = strlen(todayMinStr) * 4;
        int16_t todaySlashW = 4;
        int16_t todayMaxW = strlen(todayMaxStr) * 4;
        int16_t todayTotalW = todayMinW + todaySlashW + todayMaxW;
        int16_t todayX = DISPLAY_WIDTH - todayTotalW - 1;

        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(coldBlue);
        dma_display->setCursor(todayX, 8);
        dma_display->print(todayMinStr);
        dma_display->setTextColor(gray);
        dma_display->setCursor(todayX + todayMinW, 8);
        dma_display->print("/");
        dma_display->setTextColor(warmRed);
        dma_display->setCursor(todayX + todayMinW + todaySlashW, 8);
        dma_display->print(todayMaxStr);

        // ---- Separator (y=10) ----
        dma_display->fillRect(0, 10, DISPLAY_WIDTH, 1, black);
        drawSeparatorLine(10, dimGray);

        // ---- Date (y=22-30) ----
        dma_display->fillRect(0, 22, DISPLAY_WIDTH, 9, black);
        unsigned long epochTime = timeClient.getEpochTime();
        struct tm* timeinfo = gmtime((time_t*)&epochTime);

        static const char* dayNamesFr[] = {"DIM", "LUN", "MAR", "MER", "JEU", "VEN", "SAM"};
        static const char* monthNamesFr[] = {"JAN", "FEV", "MAR", "AVR", "MAI", "JUN",
                                             "JUL", "AOU", "SEP", "OCT", "NOV", "DEC"};

        char dateStr[16];
        snprintf(dateStr, sizeof(dateStr), "%s %02d %s",
                 dayNamesFr[timeinfo->tm_wday],
                 timeinfo->tm_mday,
                 monthNamesFr[timeinfo->tm_mon]);

        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(gray);

        int16_t dateWidth = strlen(dateStr) * 6;
        int16_t dateX = (DISPLAY_WIDTH - dateWidth) / 2;
        dma_display->setCursor(dateX, 23);
        dma_display->print(dateStr);

        // ---- Separator (y=31) ----
        drawSeparatorLine(31, dimGray);

        // ---- Forecast (y=33-63) ----
        dma_display->fillRect(0, 33, DISPLAY_WIDTH, 31, black);
        // Three columns equidistant: x=11, x=32, x=53 (~21px each)
        for (int i = 0; i < FORECAST_DAYS; i++) {
            int16_t colCenter = 11 + i * 21;

            // Day name (TomThumb baseline=39, glyphs y=34-38)
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(amber);
            int16_t dayNameWidth = strlen(weatherData.forecast[i].dayName) * 4;
            dma_display->setCursor(colCenter - dayNameWidth / 2, 39);
            dma_display->print(weatherData.forecast[i].dayName);

            // Forecast icon (8x8 native, y=41-48)
            const uint16_t* builtinForecastIcon = getBuiltinWeatherIcon(weatherData.forecast[i].icon);
            if (builtinForecastIcon) {
                drawProgmemIcon(dma_display, builtinForecastIcon, colCenter - 4, 41, 1);
            } else {
                CachedIcon* forecastIcon = getIcon(weatherData.forecast[i].icon);
                if (forecastIcon && forecastIcon->valid) {
                    drawIconAtScale(forecastIcon, colCenter - 4, 41, 1);
                }
            }

            // Min temp in blue (TomThumb baseline=56, glyphs y=51-55)
            char minStr[8];
            snprintf(minStr, sizeof(minStr), "%d", weatherData.forecast[i].tempMin);
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(coldBlue);
            int16_t minWidth = strlen(minStr) * 4;
            dma_display->setCursor(colCenter - minWidth / 2, 56);
            dma_display->print(minStr);

